Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mengzi__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 孟子曰：「伯夷辟紂，居北海之濱，聞文王作興，曰：『盍歸乎來！吾聞西伯善養老者。』太公辟紂，居東海之濱，聞文王作興，曰：『盍歸乎來！吾聞西伯善養老者。』天下有善養老，則仁人以為己歸矣。五畝之宅，樹墻下以桑，匹婦蠶之，則老者足以衣帛矣。五母雞，二母彘，無失其時，老者足以無失肉矣。百畝之田，匹夫耕之，八口之家，足以無饑矣。所謂西伯善養老者，制其田里，教之樹畜，導其妻子，使養其老。五十非帛不暖，七十非肉不飽。不暖不飽，謂之凍餒。文王之民，無凍餒之老者，此之謂也。」
en: Mencius said, 'Bo Yi, that he might avoid Zhou, was dwelling on the coast of the northern sea when he heard of the rise of king Wen. He roused himself and said, "Why should I not go and follow him? I have heard that the chief of the West knows well how to nourish the old." Tai Gong, to avoid Zhou, was dwelling on the coast of the eastern sea. When he heard of the rise of king Wen, he said, "Why should I not go and follow him? I have heard that the chief if the West knows well how to nourish the old." If there were a prince in the kingdom, who knew well how to nourish the old, all men of virtue would feel that he was the proper object for them to gather to. Around the homestead with its five mau, the space beneath the walls was planted with mulberry trees, with which the women nourished silkworms, and thus the old were able to have silk to wear. Each family had five brood hens and two brood sows, which were kept to their breeding seasons, and thus the old were able to have flesh to eat. The husbandmen cultivated their farms of 100 mu, and thus their families of eight mouths were secured against want. The expression, "The chief of the West knows well how to nourish the old," refers to his regulation of the fields and dwellings, his teaching them to plant the mulberry and nourish those animals, and his instructing the wives and children, so as to make them nourish their aged. At fifty, warmth cannot be maintained without silks, and at seventy flesh is necessary to satisfy the appetite. Persons not kept warm nor supplied with food are said to be starved and famished, but among the people of king Wen, there were no aged who were starved or famished. This is the meaning of the expression in question.'

source: 孟子曰：「易其田疇，薄其稅斂，民可使富也。食之以時，用之以禮，財不可勝用也。民非水火不生活，昏暮叩人之門戶，求水火，無弗與者，至足矣。聖人治天下，使有菽粟如水火。菽粟如水火，而民焉有不仁者乎？」
en: Mencius said, 'Let it be seen to that their fields of grain and hemp are well cultivated, and make the taxes on them light - so the people may be made rich. Let it be seen to that the people use their resources of food seasonably, and expend their wealth only on the prescribed ceremonies - so their wealth will be more than can be consumed. The people cannot live without water and fire, yet if you knock at a man's door in the dusk of the evening, and ask for water and fire, there is no man who will not give them, such is the abundance of these things. A sage governs the kingdom so as to cause pulse and grain to be as abundant as water and fire. When pulse and grain are as abundant as water and fire, how shall the people be other than virtuous?'

source: 孟子曰：「孔子登東山而小魯，登泰山而小天下。故觀於海者難為水；游於聖人之門者難為言。觀水有術，必觀其瀾。日月有明，容光必照焉。流水之為物也，不盈科不行；君子之志於道也，不成章不達。」
en: Mencius said, 'Confucius ascended the eastern hill, and Lu appeared to him small. He ascended the Tai mountain, and all beneath the heavens appeared to him small. So he who has contemplated the sea, finds it difficult to think anything of other waters, and he who has wandered in the gate of the sage, finds it difficult to think anything of the words of others. There is an art in the contemplation of water. It is necessary to look at it as foaming in waves. The sun and moon being possessed of brilliancy, their light admitted even through an orifice illuminates. Flowing water is a thing which does not proceed till it has filled the hollows in its course. The student who has set his mind on the doctrines of the sage, does not advance to them but by completing one lesson after another.'

source: 孟子曰：「雞鳴而起，孳孳為善者，舜之徒也。雞鳴而起，孳孳為利者，跖之徒也。欲知舜與跖之分，無他，利與善之間也。」
en: Mencius said, 'He who rises at cock-crowing and addresses himself earnestly to the practice of virtue, is a disciple of Shun. He who rises at cock-crowing, and addresses himself earnestly to the pursuit of gain, is a disciple of Zhi. If you want to know what separates Shun from Zhi, it is simply this: the interval between the thought of gain and the thought of virtue.'

source: 孟子曰：「楊子取『為我』，拔一毛而利天下，不為也。墨子『兼愛』，摩頂於踵利天下，為之。子莫『執中』，執中為近之。執中無權，猶執一也。所惡執一者，為其賊道也，舉一而廢百也。」
en: Mencius said, 'The principle of the philosopher Yang was "Each one for himself." Though he might have benefited the whole kingdom by plucking out a single hair, he would not have done it. The philosopher Mo loves all equally. If by rubbing smooth his whole body from the crown to the heel, he could have benefited the kingdom, he would have done it. Zi Mo holds a medium between these. By holding that medium, he is nearer the right. But by holding it without leaving room for the exigency of circumstances, it becomes like their holding their one point. The reason why I hate that holding to one point is the injury it does to the way of right principle. It takes up one point and disregards a hundred others.'

source: 孟子曰：「饑者甘食，渴者甘飲，是未得飲食之正也，饑渴害之也。豈惟口腹有饑渴之害？人心亦皆有害。人能無以饑渴之害為心害，則不及人不為憂矣。」
en: Mencius said, 'The hungry think any food sweet, and the thirsty think the same of any drink, and thus they do not get the right taste of what they eat and drink. The hunger and thirst, in fact, injure their palate. And is it only the mouth and belly which are injured by hunger and thirst? Men's minds are also injured by them. If a man can prevent the evils of hunger and thirst from being any evils to his mind, he need not have any sorrow about not being equal to other men.'

source: 孟子曰：「柳下惠不以三公易其介。」
en: Mencius said, 'Hui of Liu Xia would not for the three highest offices of State have changed his firm purpose of life.'

source: 孟子曰：「有為者，辟若掘井。掘井九軔而不及泉，猶為棄井也。」
en: Mencius said, 'A man with definite aims to be accomplished may be compared to one digging a well. To dig the well to a depth of seventy-two cubits, and stop without reaching the spring, is after all throwing away the well.'

source: 孟子曰：「堯舜，性之也；湯武，身之也；五霸，假之也。久假而不歸，惡知其非有也？」
en: Mencius said, 'Benevolence and righteousness were natural to Yao and Shun. Tang and Wu made them their own. The five chiefs of the princes feigned them. Having borrowed them long and not returned them, how could it be known they did not own them?'

source: 公孫丑曰：「伊尹曰：『予不狎于不順。』放太甲于桐，民大悅；太甲賢，又反之，民大悅。賢者之為人臣也，其君不賢，則固可放與？」孟子曰：「有伊尹之志，則可；無伊尹之志，則篡也。」
en: Gong Sun Chou said, 'Yi Yin said, "I cannot be near and see him so disobedient to reason," and therewith he banished Tai Jia to Tong. The people were much pleased. When Tai Jia became virtuous, he brought him back, and the people were again much pleased. When worthies are ministers, may they indeed banish their sovereigns in this way when they are not virtuous?' Mencius replied, 'If they have the same purpose as Yi Yin, they may. If they have not the same purpose, it would be usurpation.'

source: 公孫丑曰：「《詩》曰：『不素餐兮。』君子之不耕而食，何也？」孟子曰：「君子居是國也，其君用之，則安富尊榮；其子弟從之，則孝弟忠信。『不素餐兮』，孰大於是？」
en: Gong Sun Chou said, 'It is said, in the Book of Poetry, "He will not eat the bread of idleness!" How is it that we see superior men eating without labouring?' Mencius replied, 'When a superior man resides in a country, if its sovereign employ his counsels, he comes to tranquillity, wealth and glory. If the young in it follow his instructions, they become filial, obedient to their elders, true-hearted, and faithful. What greater example can there be than this of not eating the bread of idleness?'

source: 王子墊問曰：「士何事？」孟子曰：「尚志。」曰：「何謂尚志？」曰：「仁義而已矣。殺一無罪，非仁也；非其有而取之，非義也。居惡在？仁是也。路惡在？義是也。居仁由義，大人之事備矣。」
en: The king's son, Dian, asked Mencius, saying, 'What is the business of the unemployed scholar?' Mencius replied, 'To exalt his aim.' Tien asked again, 'What do you mean by exalting the aim?' The answer was, 'Setting it simply on benevolence and righteousness. He thinks how to put a single innocent person to death is contrary to benevolence; how to take what one has not a right to is contrary to righteousness; that one's dwelling should be benevolence; and one's path should be righteousness. Where else should he dwell? What other path should he pursue? When benevolence is the dwelling-place of the heart, and righteousness the path of the life, the business of a great man is complete.'

source: 孟子曰：「仲子，不義與之齊國而弗受，人皆信之，是舍簞食豆羹之義也。人莫大焉亡親戚、君臣、上下。以其小者，信其大者，奚可哉？」
en: Mencius said, 'Supposing that the kingdom of Qi were offered, contrary to righteousness, to Chen Zhong, he would not receive it, and all people believe in him, as a man of the highest worth. But this is only the righteousness which declines a dish of rice or a plate of soup. A man can have no greater crimes than to disown his parents and relatives, and the relations of sovereign and minister, superiors and inferiors. How can it be allowed to give a man credit for the great excellences because he possesses a small one?'

source: 桃應問曰：「舜為天子，皋陶為士，瞽瞍殺人，則如之何？」孟子曰：「執之而已矣。」「然則舜不禁與？」曰：「夫舜惡得而禁之？夫有所受之也。」「然則舜如之何？」曰：「舜視棄天下，猶棄敝蹝也。竊負而逃，遵海濱而處，終身欣然，樂而忘天下。」
en: Tao Ying asked, saying, 'Shun being sovereign, and Gao Yao chief minister of justice, if Gu Sou had murdered a man, what would have been done in the case?' Mencius said, 'Gao Yao would simply have apprehended him.' 'But would not Shun have forbidden such a thing?' 'Indeed, how could Shun have forbidden it? Gao Yao had received the law from a proper source.' 'In that case what would Shun have done?' 'Shun would have regarded abandoning the kingdom as throwing away a worn-out sandal. He would privately have taken his father on his back, and retired into concealment, living some where along the sea-coast. There he would have been all his life, cheerful and happy, forgetting the kingdom.'

source: 孟子自范之齊，望見齊王之子，喟然嘆曰：「居移氣，養移體，大哉居乎！夫非盡人之子與？」孟子曰：「王子宮室、車馬、衣服多與人同，而王子若彼者，其居使之然也。況居天下之廣居者乎？魯君之宋，呼於垤澤之門。守者曰：『此非吾君也，何其聲之似我君也？』此無他，居相似也。」
en: Mencius, going from Fan to Qi, saw the king of Qi's son at a distance, and said with a deep sigh, 'One's position alters the air, just as the nurture affects the body. Great is the influence of position! Are we not all men's sons in this respect?' Mencius said, 'The residence, the carriages and horses, and the dress of the king's son, are mostly the same as those of other men. That he looks so is occasioned by his position. How much more should a peculiar air distinguish him whose position is in the wide house of the world! 'When the prince of Lu went to Song, he called out at the Die Shi gate, and the keeper said, "This is not our prince. How is it that his voice is so like that of our prince?" This was occasioned by nothing but the correspondence of their positions.'

source: 孟子曰：「食而弗愛，豕交之也。愛而不敬，獸畜之也。恭敬者，幣之未將者也。恭敬而無實，君子不可虛拘。」
en: Mencius said, 'To feed a scholar and not love him, is to treat him as a pig. To love him and not respect him, is to keep him as a domestic animal. Honouring and respecting are what exist before any offering of gifts. If there be honouring and respecting without the reality of them, a superior man may not be retained by such empty demonstrations.'

source: 孟子曰：「形色，天性也。惟聖人然後可以踐形。」
en: Mencius said, 'The bodily organs with their functions belong to our Heaven-conferred nature. But a man must be a sage before he can satisfy the design of his bodily organization.'

source: 齊宣王欲短喪。公孫丑曰：「為期之喪，猶愈於已乎？」孟子曰：「是猶或紾其兄之臂，子謂之『姑徐徐』云爾。亦教之孝弟而已矣。」王子有其母死者，其傅為之請數月之喪。公孫丑曰：「若此者，何如也？」曰：「是欲終之而不可得也，雖加一日愈於已。謂夫莫之禁而弗為者也。」
en: The king Xuan of Qi wanted to shorten the period of mourning. Gong Sun Chou said, 'To have one whole year's mourning is better than doing away with it altogether.' Mencius said, 'That is just as if there were one twisting the arm of his elder brother, and you were merely to say to him "Gently, gently, if you please." Your only course should be to teach such an one filial piety and fraternal duty.' At that time, the mother of one of the king's sons had died, and his tutor asked for him that he might be allowed to observe a few months' mourning. Gong Sun Chou asked, 'What do you say of this?' Mencius replied, 'This is a case where the party wishes to complete the whole period, but finds it impossible to do so. The addition of even a single day is better than not mourning at all. I spoke of the case where there was no hindrance, and the party neglected the thing itself.'

source: 孟子曰：「君子之所以教者五：有如時雨化之者，有成德者，有達財者，有答問者，有私淑艾者。此五者，君子之所以教也。」
en: Mencius said, 'There are five ways in which the superior man effects his teaching. There are some on whom his influence descends like seasonable rain. There are some whose virtue he perfects, and some of whose talents he assists the development. There are some whose inquiries he answers. There are some who privately cultivate and correct themselves. These five ways are the methods in which the superior man effects his teaching.'

source: 公孫丑曰：「道則高矣、美矣，宜若登天然，似不可及也。何不使彼為可幾及而日孳孳也？」孟子曰：「大匠不為拙工改廢繩墨；羿不為拙射變其彀率。君子引而不發，躍如也。中道而立，能者從之。」
en: Gong Sun Chou said, 'Lofty are your principles and admirable, but to learn them may well be likened to ascending the heavens - something which cannot be reached. Why not adapt your teaching so as to cause learners to consider them attainable, and so daily exert themselves!' Mencius said, 'A great artificer does not, for the sake of a stupid workman, alter or do away with the marking-line. Yi did not, for the sake of a stupid archer, charge his rule for drawing the bow. The superior man draws the bow, but does not discharge the arrow, having seemed to leap with it to the mark; and he there stands exactly in the middle of the path. Those who are able, follow him.'

source: 孟子曰：「天下有道，以道殉身；天下無道，以身殉道。未聞以道殉乎人者也。」
en: Mencius said, 'When right principles prevail throughout the kingdom, one's principles must appear along with one's person. When right principles disappear from the kingdom, one's person must vanish along with one's principles. I have not heard of one's principles being dependent for their manifestation on other men.'

source: 公都子曰：「滕更之在門也，若在所禮，而不答，何也？」孟子曰：「挾貴而問，挾賢而問，挾長而問，挾有勛勞而問，挾故而問，皆所不答也。滕更有二焉。」
en: The disciple Gong Du said, 'When Geng of Tang made his appearance in your school, it seemed proper that a polite consideration should be paid to him, and yet you did not answer him. Why was that?' Mencius replied, 'I do not answer him who questions me presuming on his nobility, nor him who presumes on his talents, nor him who presumes on his age, nor him who presumes on services performed to me, nor him who presumes on old acquaintance. Two of those things were chargeable on Geng of Tang.'

source: 孟子曰：「於不可已而已者，無所不已。於所厚者薄，無所不薄也。其進銳者，其退速。」
en: Mencius said, 'He who stops short where stopping is acknowledged to be not allowable, will stop short in everything. He who behaves shabbily to those whom he ought to treat well, will behave shabbily to all. He who advances with precipitation will retire with speed.'

source: 孟子曰：「君子之於物也，愛之而弗仁；於民也，仁之而弗親。親親而仁民，仁民而愛物。」
en: Mencius said, 'In regard to inferior creatures, the superior man is kind to them, but not loving. In regard to people generally, he is loving to them, but not affectionate. He is affectionate to his parents, and lovingly disposed to people generally. He is lovingly disposed to people generally, and kind to creatures.'

source: 孟子曰：「知者無不知也，當務之為急；仁者無不愛也，急親賢之為務。堯舜之知而不遍物，急先務也。堯舜之仁不遍愛人，急親賢也。不能三年之喪，而緦小功之察：放飯流歠，而問無齒決：是之謂不知務。」
en: Mencius said, 'The wise embrace all knowledge, but they are most earnest about what is of the greatest importance. The benevolent embrace all in their love, but what they consider of the greatest importance is to cultivate an earnest affection for the virtuous. Even the wisdom of Yao and Shun did not extend to everything, but they attended earnestly to what was important. Their benevolence did not show itself in acts of kindness to every man, but they earnestly cultivated an affection for the virtuous. Not to be able to keep the three years' mourning, and to be very particular about that of three months, or that of five months; to eat immoderately and swill down the soup, and at the same time to inquire about the precept not to tear the meat with the teeth; such things show what I call an ignorance of what is most important.

source: 孟子曰：「不仁哉，梁惠王也！仁者，以其所愛及其所不愛；不仁者，以其所不愛及其所愛。」公孫丑問曰：「何謂也？」「梁惠王以土地之故，糜爛其民而戰之，大敗；將復之，恐不能勝，故驅其所愛子弟以殉之；是之謂以其所不愛及其所愛也。」
en: Mencius said, 'The opposite indeed of benevolent was the king Hui of Liang! The benevolent, beginning with what they care for, proceed to what they do not care for. Those who are the opposite of benevolent, beginning with what they do not care for, proceed to what they care for.' Gong Sun Chou said, 'What do you mean?' Mencius answered, 'The king Hui of Liang, for the matter of territory, tore and destroyed his people, leading them to battle. Sustaining a great defeat, he would engage again, and afraid lest they should not be able to secure the victory, urged his son whom he loved till he sacrificed him with them. This is what I call "beginning with what they do not care for, and proceeding to what they care for."'

source: 孟子曰：「《春秋》無義戰，彼善於此，則有之矣。征者，上伐下也，敵國不相征也。」
en: Mencius said, 'In the "Spring and Autumn" there are no righteous wars. Instances indeed there are of one war better than another. "Correction" is when the supreme authority punishes its subjects by force of arms. Hostile States do not correct one another.'

source: 孟子曰：「盡信《書》，則不如無《書》。吾於《武成》，取二三策而已矣。仁人無敵於天下。以至仁伐至不仁，而何其血之流杵也？」
en: Mencius said, 'It would be better to be without the Book of History than to give entire credit to it. In the "Completion of the War," I select two or three passages only, which I believe. "The benevolent man has no enemy under heaven. When the prince the most benevolent was engaged against him who was the most the opposite, how could the blood of the people have flowed till it floated the pestles of the mortars?"'

source: 孟子曰：「有人曰：『我善為陳，我善為戰』，大罪也。國君好仁，天下無敵焉，南面而征北狄怨，東面而征西夷怨，曰：『奚為後我？』武王之伐殷也，革車三百兩，虎賁三千人。王曰：『無畏！寧爾也，非敵百姓也。』若崩厥角稽首。征之為言正也，各欲正己也，焉用戰？」
en: Mencius said, 'There are men who say "I am skilful at marshalling troops, I am skilful at conducting a battle!" They are great criminals. If the ruler of a State love benevolence, he will have no enemy in the kingdom. When Tang was executing his work of correction in the south, the rude tribes on the north murmured. When he was executing it in the east, the rude tribes on the west murmured. Their cry was "Why does he make us last?" When king Wu punished Yin, he had only three hundred chariots of war, and three thousand life-guards. The king said, "Do not fear. Let me give you repose. I am no enemy to the people!" On this, they bowed their heads to the earth, like the horns of animals falling off. "Royal correction" is but another word for rectifying. Each State wishing itself to be corrected, what need is there for fighting?'

source: 孟子曰：「梓匠輪輿，能與人規矩，不能使人巧。」
en: Mencius said, 'A carpenter or a carriage-maker may give a man the circle and square, but cannot make him skilful in the use of them.'

source: 孟子曰：「舜之飯糗茹草也，若將終身焉。及其為天子也，被袗衣，鼓琴，二女果，若固有之。」
en: Mencius said, 'Shun's manner of eating his parched grain and herbs was as if he were to be doing so all his life. When he became sovereign, and had the embroidered robes to wear, the lute to play, and the two daughters of Yao to wait on him, he was as if those things belonged to him as a matter of course.'

source: 孟子曰：「吾今而後知殺人親之重也：殺人之父，人亦殺其父；殺人之兄，人亦殺其兄。然則非自殺之也，一間耳。」
en: Mencius said, 'From this time forth I know the heavy consequences of killing a man's near relations. When a man kills another's father, that other will kill his father; when a man kills another's elder brother, that other will kill his elder brother. So he does not himself indeed do the act, but there is only an interval between him and it.'

source: 孟子曰：「古之為關也，將以御暴；今之為關也，將以為暴。」
en: Mencius said, 'Anciently, the establishment of the frontier-gates was to guard against violence. Nowadays, it is to exercise violence.'

source: 孟子曰：「身不行道，不行於妻子；使人不以道，不能行於妻子。」
en: Mencius said, 'If a man himself do not walk in the right path, it will not be walked in even by his wife and children. If he order men according to what is not the right way, he will not be able to get the obedience of even his wife and children.'

source: 孟子曰：「周于利者，兇年不能殺；周於德者，邪世不能亂。」
en: Mencius said, 'A bad year cannot prove the cause of death to him whose stores of gain are large; an age of corruption cannot confound him whose equipment of virtue is complete.'

source: 孟子曰：「好名之人能讓千乘之國。茍非其人，簞食、豆羹見於色。」
en: Mencius said, 'A man who loves fame may be able to decline a State of a thousand chariots; but if he be not really the man to do such a thing, it will appear in his countenance, in the matter of a dish of rice or a platter of soup.'

source: 孟子曰：「不信仁賢，則國空虛；無禮義，則上下亂；無政事，則財用不足。」
en: Mencius said, 'If men of virtue and ability be not confided in, a State will become empty and void. Without the rules of propriety and distinctions of right, the high and the low will be thrown into confusion. Without the great principles of government and their various business, there will not be wealth sufficient for the expenditure.'

source: 孟子曰：「不仁而得國者，有之矣；不仁而得天下者，未之有也。」
en: Mencius said, 'There are instances of individuals without benevolence, who have got possession of a single State, but there has been no instance of the throne's being got by one without benevolence.'

source: 孟子曰：「民為貴，社稷次之，君為輕。是故得乎丘民而為天子；得乎天子為諸侯；得乎諸侯為大夫。諸侯危社稷，則變置；犧牲既成，粢盛既潔，祭祀以時，然而旱乾水溢，則變置社稷。」
en: Mencius said, 'The people are the most important element in a nation; the spirits of the land and grain are the next; the sovereign is the lightest. Therefore to gain the peasantry is the way to become sovereign; to gain the sovereign is the way to become a prince of a State; to gain the prince of a State is the way to become a great officer. When a prince endangers the altars of the spirits of the land and grain, he is changed, and another appointed in his place. When the sacrificial victims have been perfect, the millet in its vessels all pure, and the sacrifices offered at their proper seasons, if yet there ensue drought, or the waters overflow, the spirits of the land and grain are changed, and others appointed in their place.'

source: 孟子曰：「聖人，百世之師也，伯夷、柳下惠是也。故聞伯夷之風者，頑夫廉，懦夫有立志。聞柳下惠之風者，薄夫敦，鄙夫寬。奮乎百世之上，百世之下聞者莫不興起也。非聖人而能若是乎？而況於親炙之者乎？」
en: Mencius said, 'A sage is the teacher of a hundred generations - this is true of Bo Yi and Hui of Liu Xia. Therefore when men now bear the character of Bo Yi, the corrupt become pure, and the weak acquire determination. When they hear the character of Hui of Liu Xia, the mean become generous, and the niggardly become liberal. Those two made themselves distinguished a hundred generations ago, and after a hundred generations, those who hear of them, are all aroused in this manner. Could such effects be produced by them, if they had not been sages? And how much more did they affect those who were in contiguity with them, and felt their inspiring influence!'

source: 孟子曰：「仁也者，人也；合而言之，道也。」
en: Mencius said, 'Benevolence is the distinguishing characteristic of man. As embodied in man's conduct, it is called the path of duty.'

source: 孟子曰：「孔子之去魯，曰：『遲遲吾行也』，去父母國之道也。去齊，接淅而行，去他國之道也。」
en: Mencius said, 'When Confucius was leaving Lu, he said, "I will set out by-and-by;" - this was the way in which to leave the State of his parents. When he was leaving Qi, he strained off with his hand the water in which his rice was being rinsed, took the rice, and went away - this was the way in which to leave a strange State.'

source: 孟子曰：「君子之戹於陳、蔡之間，無上下之交也。」
en: Mencius said, 'The reason why the superior man was reduced to straits between Chen and Cai was because neither the princes of the time nor their ministers sympathized or communicated with him.'
